# -----------------------------
# 단위 및 스케일 설정
# -----------------------------
# 초음파 센서 거리 (cm → m 단위로 변환)
DISTANCE_SCALE = 0.025     
CALIBRATION_SCALE = 1.0  # 거리센서 보정 계수 (필요 시 조정)
# 속도 변환 (0~1 스로틀 → km/h 대략적 환산)
SPEED_CONVERT = 50.0     # 1.0 스로틀 ≈ 50km/h 정도로 가정

# -----------------------------
# 정책 입력 범위
# -----------------------------
EGO_SPEED_MIN = 0.0
EGO_SPEED_MAX = 50.0

FRONT_DIST_MIN = -1.0
FRONT_DIST_MAX = 100.0

LANE_ID_MIN = 0.0
LANE_ID_MAX = 1.0

# -----------------------------
# RL 행동(Action) 정의
# -----------------------------
LANE_LEFT  = 0   # 좌측 차선 변경
IDLE       = 1   # 유지
LANE_RIGHT = 2   # 우측 차선 변경
FASTER     = 3   # 가속
SLOWER     = 4   # 감속


# -----------------------------
# 주행 제어 파라미터 (lane_follow에서 사용)
# -----------------------------
BASE_SPEED = 0.55     # 기본 주행 속도
MAX_SPEED = 1.0
MIN_SPEED = 0.2
SPEED_STEP = 0.05    # 가속/감속 시 속도 변화량

# -----------------------------
# 조향 하드웨어 기준값
# -----------------------------
STEERING_CENTER = 81.5   # 서보 중앙 위치 (보정 필요)
MAX_STEER  = 45       # 최대 조향각 제한
STEERING_KP = 1.1
KP = 0.66             # 단순 P 제어 이득 (조향 민감도)


# -----------------------------
# Line_follow
# -----------------------------
LANE_WIDTH_PX = 360      # 영상 상의 차선 폭 (픽셀 단위)
LANE_WIDTH_CM = 23.5     # 실제 차선 폭 (센티미터 단위)
LANE_KP = 0.6
LANE_CENTER_BIAS = -60
CAMERA_CENTER_OFFSET = -20 # 오른쪽으로 가려면 +
# -----------------------------


# -----------------------------
# 장애물 감지 판단 거리
# -----------------------------
OBSTACLE_CHANGE_DIST = 0.9


# -----------------------------
# 차선변경 시 steering, speed
# -----------------------------
LANE_CHANGE_STEER    = 34
LANE_CHANGE_SPEED    = 0.8
LANE_CHANGE_DURATION = 0.9
LANE_SETTLE_DURATION = 0.5
# -----------------------------